tap "homebrew/bundle"
tap "homebrew/cask"
tap "yt-dlp/taps"

brew "iperf3"
brew "mas"
brew "yt-dlp/taps/yt-dlp"

cask "fliqlo"
cask "hiddenbar"
cask "cheatsheet"
cask "istat-menus"
cask "background-music"

cask "obs"
cask "altserver"
cask "adobe-acrobat-pro"
cask "docker", args: { appdir: "/Applications" }
cask "google-chrome"
cask "visual-studio-code"

mas "Xcode", id: 497799835

mas "Paste", id: 1554034946
mas "Magnet", id: 441258766
mas "新建文件菜单", id: 1064959555
mas "Cleaner", id:1597938160

mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Craft", id: 1487937127

mas "Microsoft Word", id: 462054704
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466