tap "homebrew/bundle"
# tap "homebrew/cask"
# tap "yt-dlp/taps"

brew "mas"
brew "iperf3"
brew "tree"
brew "swift-format"

brew "volta"
brew "pyenv"
brew "poetry"
brew "rustup-init"
brew "kubectl"
# brew "rbenv"
# brew "ruby-build"

cask "fliqlo"
cask "bartender"
# cask "cheatsheet"
cask "istat-menus"
# You need a Pre-release version of background-music
# check https://github.com/kyleneideck/BackgroundMusic/releases
# cask "background-music"

cask "obs"
cask "altserver"
# cask "adobe-acrobat-pro"
cask "docker", args: { appdir: "/Applications" }
cask "google-chrome"
# cask "google-drive"
cask "synology-drive"
cask "visual-studio-code"
cask "fig"
cask "rectangle"

# You'd better install this manually
# mas "Xcode", id: 497799835

mas "FastZip", id: 1565629813
# mas "Magnet", id: 441258766
# mas "新建文件菜单", id: 1064959555
mas "Cleaner", id:1597938160

mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Craft", id: 1487937127

# mas "Microsoft Remote Desktop", id: 1295203466
# mas "Microsoft Word", id: 462054704
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft OneNote", id: 784801555
# mas "Microsoft Outlook", id: 985367838
# mas "Microsoft PowerPoint", id: 462062816
